#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
tls_private_key.rsa_key: Refreshing state... [id=c83a84715348a38fa7293015c6e224149c322885]
local_file.tfkey: Refreshing state... [id=beb7ff1fd9dbd54b9fb2f4cf6ece49d7d8671c3b]
aws_key_pair.terraform_key: Refreshing state... [id=terraform_key]
data.aws_ami.java-ami: Reading...
aws_eip.nat_gateway: Refreshing state... [id=eipalloc-0087dee5c02bfe9b1]
aws_vpc.main: Refreshing state... [id=vpc-0f6d5a94f46645320]
data.aws_ami.java-ami: Read complete after 0s [id=ami-0f69d0e1e5f4701f9]
aws_security_group.elb: Refreshing state... [id=sg-0f7868807e44f3512]
aws_subnet.privatesubnet_2: Refreshing state... [id=subnet-0398ddded029009fa]
aws_subnet.publicsubnet_2: Refreshing state... [id=subnet-0e11d8679902025e1]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-0350b8b6357097c31]
aws_security_group.allow_http: Refreshing state... [id=sg-0fa01741466d9a25c]
aws_security_group.allow_ssh: Refreshing state... [id=sg-0a785dec6674235ff]
aws_subnet.publicsubnet_1: Refreshing state... [id=subnet-09fc0634ae599da83]
aws_subnet.privatesubnet_1: Refreshing state... [id=subnet-0d244f156f0513ac7]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-0168fbc6a2c84a28f]
aws_instance.bastion-host: Refreshing state... [id=i-0333bdf861b8ed124]
aws_route_table.public_route_table: Refreshing state... [id=rtb-09a833cec6df84bd4]
aws_launch_configuration.ec2_config: Refreshing state... [id=terraform-20230126170700034400000001]
aws_elb.elastic-load-balancer: Refreshing state... [id=ELB]
aws_route_table.private_route_table: Refreshing state... [id=rtb-034cd6757223234f8]
aws_route_table_association.public_route_table_association_2: Refreshing state... [id=rtbassoc-0e74d0d3bb0c49d94]
aws_route_table_association.public_route_table_association_1: Refreshing state... [id=rtbassoc-03be9ffea49056428]
aws_route_table_association.private_route_table_association_2: Refreshing state... [id=rtbassoc-06ab69d6a37d739fa]
aws_route_table_association.private_route_table_association_1: Refreshing state... [id=rtbassoc-0c80056429d7920ac]
aws_autoscaling_group.auto_scaling_group: Refreshing state... [id=Auto Scaling Group]
aws_autoscaling_attachment.asg_attachment: Refreshing state... [id=Auto Scaling Group-20230126170816203600000004]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_autoscaling_group.auto_scaling_group will be updated in-place
  ~ resource "aws_autoscaling_group" "auto_scaling_group" {
        id                        = "Auto Scaling Group"
      ~ launch_configuration      = "terraform-20230126170700034400000001" -> (known after apply)
      ~ load_balancers            = [
          - "ELB",
        ]
        name                      = "Auto Scaling Group"
        # (22 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_launch_configuration.ec2_config must be replaced
+/- resource "aws_launch_configuration" "ec2_config" {
      ~ arn                              = "arn:aws:autoscaling:us-east-1:789101626358:launchConfiguration:1c0bbe62-1b53-4d6a-978f-7ee644495f2a:launchConfigurationName/terraform-20230126170700034400000001" -> (known after apply)
      ~ ebs_optimized                    = false -> (known after apply)
      ~ id                               = "terraform-20230126170700034400000001" -> (known after apply)
      ~ image_id                         = "ami-0bb72a5815ce34005" -> "ami-0f69d0e1e5f4701f9" # forces replacement
      ~ name                             = "terraform-20230126170700034400000001" -> (known after apply)
      ~ name_prefix                      = "terraform-" -> (known after apply)
      - vpc_classic_link_security_groups = [] -> null
        # (6 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # local_file.tfkey will be created
  + resource "local_file" "tfkey" {
      + content              = (sensitive value)
      + directory_permission = "0777"
      + file_permission      = "400"
      + filename             = "tfkey"
      + id                   = (known after apply)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @ludicsa, Action: `pull_request`*